#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

Адрес = Параметры.Адрес;

ДанныеОтпуска = ПолучитьИзВременногоХранилища(Адрес);

АнализОтпусков.Очистить();

Для Каждого Строка Из ДанныеОтпуска Цикл
	Точка = АнализОтпусков.УстановитьТочку(Строка.Сотрудник);
	Серия = АнализОтпусков.УстановитьСерию("Отпуск");
	Значение = АнализОтпусков.ПолучитьЗначение(Точка,Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало = Строка.ДатаНачала;
	Интервал.Конец = Строка.ДатаОкончания;
	
КонецЦикла;

КонецПроцедуры

#КонецОбласти
