#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьВТГНаСервере()
	ВКМ_ИнтеграцияТГ.ОтправитьСообщение();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	Элементы.Список.Обновить();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВТГ(Команда)
	ОтправитьВТГНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти
