
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Проведен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо распровести документ");
	ИНаче 
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
					|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение,
					|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток
					|ИЗ
					|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяСтрока = Объект.Выплаты.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.Подразделение = Выборка.Подразделение;
		НоваяСтрока.Сумма = Выборка.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры
